import pygame
import time
from gtts import gTTS
from mutagen.mp3 import MP3

english = 'Recognised tablet is Cheston Cold, It is used for Cough and Cold'
kannada = 'Gurutisalpaṭṭa ṭableṭ cheston cold , idhanu kemmu matthu śītakke bhaḷasalaguthadhe'
cheston = 'ಗುರುತಿಸಲ್ಪಟ್ಟ ಟ್ಯಾಬ್ಲೆಟ್ ಚೆಸ್ಟನ್ ಶೀತವಾಗಿದೆ, ಇದನ್ನು ಕೆಮ್ಮು ಮತ್ತು ಶೀತಕ್ಕೆ ಬಳಸಲಾಗುತ್ತದೆ'
saridon = 'ಗುರುತಿಸಲ್ಪಟ್ಟ ಟ್ಯಾಬ್ಲೆಟ್ ಸ್ಯಾರಿಡಾನ್ ಆಗಿದೆ, ಇದನ್ನು ತಲೆನೋವಿಗೆ ಬಳಸಲಾಗುತ್ತದೆ'
azithromycin = 'ಗುರುತಿಸಲ್ಪಟ್ಟ ಟ್ಯಾಬ್ಲೆಟ್ ಅಜಿಥ್ರೊಮೈಸಿನ್ ಆಗಿದೆ, ಇದನ್ನು ಹೊಟ್ಟೆಯ ಸೋಂಕಿಗೆ ಬಳಸಲಾಗುತ್ತದೆ'
lisino= 'ಗುರುತಿಸಲ್ಪಟ್ಟ ಟ್ಯಾಬ್ಲೆಟ್ ಲಿಸಿನೊಪ್ರಿಲ್ ಆಗಿದೆ, ಇದನ್ನು ರಕ್ತದೊತ್ತಡವನ್ನು ನಿಯಂತ್ರಿಸಲು ಬಳಸಲಾಗುತ್ತದೆ'
para='ಗುರುತಿಸಲ್ಪಟ್ಟ ಟ್ಯಾಬ್ಲೆಟ್ ಪ್ಯಾರೆಸಿಟಮಾಲ್ ಆಗಿದೆ, ಇದನ್ನು ಜ್ವರ ಮತ್ತು ದೇಹ ನೋವುಗಳಿಗೆ ಬಳಸಲಾಗುತ್ತದೆ'
notab='ಟ್ಯಾಬ್ಲೆಟ್ ಗುರುತಿಸಲಾಗಿಲ್ಲ'
rem= 'Parihāara gaḷu'


heal='ಸಸ್ಯವು ಆರೋಗ್ಯಕರವಾಗಿದೆ'
bact='ಗುರುತಿಸಲಾದ ರೋಗವು ಬ್ಯಾಕ್ಟೀರಿಯಾದ ಚುಕ್ಕೆ ಮತ್ತು ಬ್ಯಾಕ್ಟೀರಿಯಾದ ಪರಿಹಾರಗಳು ಅಗತ್ಯವಿದ್ದರೆ ಯಾವುದೇ ಪೀಡಿತ ಎಲೆ ಅಥವಾ ಸಂಪೂರ್ಣ ಸಸ್ಯವನ್ನು ತ್ಯಜಿಸಿ ಮತ್ತು ಸ್ಟ್ರೆಪ್ಟೊಮೈಸಿನ್ ಅಥವಾ ಆಕ್ಸಿಟೆಟ್ರಾಸೈಕ್ಲಿನ್‌ನಂತಹ ಪ್ರತಿಜೀವಕಗಳನ್ನು ಬಳಸಿ.'
earl='ರೋಗವನ್ನು ಅರ್ಲಿ ಬ್ಲೈಟ್ ಎಂದು ಗುರುತಿಸಲಾಗಿದೆ ಮತ್ತು ಅರ್ಲಿಬ್ಲೈಟ್‌ಗೆ ಪರಿಹಾರಗಳು ತಾಮ್ರದ ಶಿಲೀಂಧ್ರನಾಶಕ ಸಾಂದ್ರೀಕರಣದೊಂದಿಗೆ ಬೋನೈಡ್ ದ್ರವವನ್ನು ಸಸ್ಯಕ್ಕೆ ಸಿಂಪಡಿಸಿ ಮತ್ತು ಸಸ್ಯಗಳಿಗೆ ಬರುವ ಮೊದಲು ಬ್ಯಾಕ್ಟೀರಿಯಾವನ್ನು ಕೊಲ್ಲಲು ಮಣ್ಣನ್ನು ಸೌರಗೊಳಿಸುವುದು.'
late='ರೋಗವನ್ನು ಲೇಟ್ ಬ್ಲೈಟ್ ಎಂದು ಗುರುತಿಸಲಾಗಿದೆ ಮತ್ತು ತಡವಾದ ರೋಗಕ್ಕೆ ಪರಿಹಾರಗಳು ಅಗತ್ಯವಿದ್ದರೆ ಯಾವುದೇ ಪೀಡಿತ ಎಲೆ ಅಥವಾ ಸಂಪೂರ್ಣ ಸಸ್ಯವನ್ನು ತ್ಯಜಿಸಿ ಮತ್ತು ಸ್ಟ್ರೆಪ್ಟೊಮೈಸಿನ್ ಅಥವಾ ಆಕ್ಸಿಟೆಟ್ರಾಸೈಕ್ಲಿನ್‌ನಂತಹ ಪ್ರತಿಜೀವಕಗಳನ್ನು ಬಳಸಿ.'
mold='ರೋಗವನ್ನು ಗುರುತಿಸಲಾಗಿದೆ ಲೀಫ್‌ಮೋಲ್ಡ್ ಮತ್ತು ಲೀಫ್‌ಮಾಲ್ಡ್‌ಗೆ ಪರಿಹಾರಗಳು ಸಸ್ಯದ ಮೇಲೆ ನೀರುಹಾಕುವುದನ್ನು ತಪ್ಪಿಸಿ ಮತ್ತು ಕ್ಯಾಲ್ಸಿಯಂ ಕ್ಲೋರೈಡ್ ಆಧಾರಿತ ಸ್ಪ್ರೇಗಳನ್ನು ಬಳಸಿ.'
sept='ಗುರುತಿಸಲಾದ ರೋಗವೆಂದರೆ ಸೆಪ್ಟೋರಿಯಾ ಮತ್ತು ಸ್ಪೆಕ್ಟೋರಿಯಾಕ್ಕೆ ಪರಿಹಾರಗಳು ಎಲ್ಲಾ ಬಿದ್ದ ಸಸ್ಯದ ಅವಶೇಷಗಳನ್ನು ತೆಗೆದುಹಾಕಿ ಮತ್ತು ತಾಮ್ರದ ಶಿಲೀಂಧ್ರನಾಶಕಗಳನ್ನು ಬಳಸಿ.'
yell='ಹಳದಿ ಎಲೆ ಸುರುಳಿ ವೈರಸ್ ಎಂದು ಗುರುತಿಸಲ್ಪಟ್ಟ ರೋಗ ಮತ್ತು ಹಳದಿ ಎಲೆ ಸುರುಳಿಯ ವೈರಸ್‌ಗೆ ಪರಿಹಾರಗಳು ಬೆಂಜಿಮಿಡಾಜೋಲ್ ಶಿಲೀಂಧ್ರನಾಶಕಗಳಂತಹ ಶಿಲೀಂಧ್ರನಾಶಕಗಳ ಬಳಕೆ ಮತ್ತು ಬಾಧಿತ ಸಸ್ಯವನ್ನು ಅಗೆದು ವಿಲೇವಾರಿ ಮಾಡುವುದು.'
noleaf='ಯಾವುದೇ ಎಲೆ ಪತ್ತೆಯಾಗಿಲ್ಲ.'


#print('Recognised Tablet: ',english)
myobj = gTTS(text=mold, lang='kn', slow =False)
myobj.save("voice.mp3")
song = MP3("voice.mp3")
pygame.mixer.init()
pygame.mixer.music.load('voice.mp3')
pygame.mixer.music.play()
time.sleep(song.info.length)
pygame.quit()
